{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## User drilldown workbook\n---\n**Note:** All data in this workbook excludes whitelisted events."
      },
      "name": "text - 2"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "1e71dd48-a0e4-44df-bd9e-1d40e8fd5691",
            "version": "KqlParameterItem/1.0",
            "name": "time_span",
            "label": "Timespan",
            "type": 4,
            "description": "Selects time range of the drilldown",
            "isRequired": true,
            "value": {
              "durationMs": 172800000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            }
          },
          {
            "id": "4963c841-91ea-4077-98a4-56e8130a4927",
            "version": "KqlParameterItem/1.0",
            "name": "user_name_value",
            "label": "User name",
            "type": 2,
            "description": "Selects the username to target during drilldown",
            "isRequired": true,
            "query": "Sysmon\r\n| where isnotempty(technique_name)\r\n| summarize by UserName",
            "value": "NT AUTHORITY\\SYSTEM",
            "typeSettings": {
              "additionalResourceOptions": []
            },
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "time_span",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path_create_whitelist = process_create_whitelist | project process_path;\nlet process_path_access_whitelist = process_access_whitelist | project process_path;\nlet process_path_dns_whitelist = dns_whitelist | project process_path;\nlet process_path_file_create_whitelist = file_create_whitelist | project process_path;\nlet process_path_image_load_whitelist = image_load_whitelist | project process_path;\nlet process_path_network_whitelist = network_whitelist | project process_path;\nlet process_path_pipe_whitelist = pipe_whitelist | project process_path;\nlet process_path_registry_whitelist = registry_whitelist | project process_path;\nSysmon\n| where UserName contains @\"{user_name_value}\"\n| where isnotempty(technique_name)\n| where process_path !in~ (process_path_create_whitelist) and process_path !in~ (process_path_access_whitelist) and process_path !in~ (process_path_dns_whitelist) and process_path !in~ (process_path_file_create_whitelist) and process_path !in~ (process_path_image_load_whitelist) and process_path !in~ (process_path_network_whitelist) and process_path !in~ (process_path_pipe_whitelist) and process_path !in~ (process_path_registry_whitelist)\n| summarize count() by technique_name, bin(TimeGenerated, 1h)",
        "size": 1,
        "showAnalytics": true,
        "title": "User activity by technique",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "scatterchart"
      },
      "name": "user-activity-by-technique-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path_create_whitelist = process_create_whitelist | project process_path;\r\nlet process_path_access_whitelist = process_access_whitelist | project process_path;\r\nlet process_path_dns_whitelist = dns_whitelist | project process_path;\r\nlet process_path_file_create_whitelist = file_create_whitelist | project process_path;\r\nlet process_path_image_load_whitelist = image_load_whitelist | project process_path;\r\nlet process_path_network_whitelist = network_whitelist | project process_path;\r\nlet process_path_pipe_whitelist = pipe_whitelist | project process_path;\r\nlet process_path_registry_whitelist = registry_whitelist | project process_path;\r\nSysmon\r\n| where isnotempty(technique_name)\r\n| where process_path !in~ (process_path_create_whitelist) and process_path !in~ (process_path_access_whitelist) and process_path !in~ (process_path_dns_whitelist) and process_path !in~ (process_path_file_create_whitelist) and process_path !in~ (process_path_image_load_whitelist) and process_path !in~ (process_path_network_whitelist) and process_path !in~ (process_path_pipe_whitelist) and process_path !in~ (process_path_registry_whitelist)\r\n| summarize c=count() by Computer, UserName\r\n| sort by c desc\r\n| project Computer, UserName, c",
        "size": 0,
        "showAnalytics": true,
        "title": "User activity by host",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "UserName",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "c",
              "formatter": 3,
              "formatOptions": {
                "palette": "green",
                "showIcon": true,
                "aggregation": "Count"
              }
            },
            {
              "columnMatch": "count_",
              "formatter": 9,
              "formatOptions": {
                "palette": "green",
                "showIcon": true
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "UserName",
              "label": "User name"
            },
            {
              "columnId": "c",
              "label": "ATT&CK Events"
            }
          ]
        }
      },
      "customWidth": "50",
      "name": "user-activity-by-host-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where (EventID == 4771 and FailureReason != 0x19) or EventID == 4625\r\n| where Account contains split(@\"{user_name_value}\", @\"\\\")[1]\r\n| summarize count() by bin(TimeGenerated, 1d)",
        "size": 0,
        "showAnalytics": true,
        "title": "Authentication Failures over time",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart",
        "tileSettings": {
          "showBorder": false,
          "titleContent": {
            "columnMatch": "Computer",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          }
        }
      },
      "customWidth": "50",
      "name": "failed-authentications-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where (EventID == 4771 and FailureReason != 0x19) or EventID == 4624\r\n| summarize count() by Account, Computer\r\n| project Account, Computer\r\n",
        "size": 0,
        "showAnalytics": true,
        "title": "Authentication failures by user and host",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "graph",
        "tileSettings": {
          "showBorder": false
        },
        "graphSettings": {
          "type": 2,
          "topContent": {
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "centerContent": {
            "columnMatch": "Account",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            },
            "tooltipFormat": {
              "tooltip": "User account"
            }
          },
          "hivesContent": {
            "columnMatch": "Computer",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            },
            "numberFormat": {
              "unit": 0,
              "options": {
                "style": "decimal"
              }
            }
          },
          "nodeIdField": "Account",
          "targetIdField": "Computer",
          "edgeLabel": "Account",
          "nodeSize": null,
          "staticNodeSize": 150,
          "colorSettings": {
            "nodeColorField": "Account",
            "type": 1,
            "colorPalette": "cool"
          },
          "groupByField": "Computer",
          "hivesMargin": 5
        }
      },
      "customWidth": "50",
      "name": "authentication-failures-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID == 4624\r\n| summarize count() by Account, Computer, LogonType\r\n| project Account, Computer, LogonType\r\n",
        "size": 0,
        "showAnalytics": true,
        "title": "Authentication success by user and host",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "graph",
        "graphSettings": {
          "type": 2,
          "topContent": {
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "centerContent": {
            "columnMatch": "Account",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            },
            "tooltipFormat": {
              "tooltip": "User account"
            }
          },
          "bottomContent": {
            "columnMatch": "LogonType",
            "formatter": 12,
            "formatOptions": {
              "showIcon": true
            },
            "tooltipFormat": {
              "tooltip": "Logon type"
            }
          },
          "hivesContent": {
            "columnMatch": "Computer",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "nodeIdField": "Account",
          "nodeSize": null,
          "staticNodeSize": 150,
          "colorSettings": {
            "nodeColorField": "Account",
            "type": 1,
            "colorPalette": "pastel"
          },
          "groupByField": "Computer",
          "hivesMargin": 5
        }
      },
      "customWidth": "50",
      "name": "Authentication-successes-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID == 4720",
        "size": 0,
        "showAnalytics": true,
        "title": "EventID 4720 - SA Accounts are excluded",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "30",
      "name": "eventid-4720-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID == 4722",
        "size": 0,
        "showAnalytics": true,
        "title": "EventID 4722 - SA and Computer Accounts are excluded",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "40",
      "name": "eventid-4722-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID == 4726",
        "size": 0,
        "showAnalytics": true,
        "title": "EventID 4726 - SA and Computer Accounts are excluded",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "30",
      "name": "eventid-4726-query",
      "styleSettings": {
        "progressStyle": "loader",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where (EventID==4720 or EventID==4738 or EventID==4728 or EventID==4732 or EventID==4746 or EventID==4751 or EventID==4756 or EventID==4761)",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Created or Changed and Added to Group",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "100",
      "name": "accounts-created-or-changed-and-added-to-group-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where (EventID==4738 or EventID==4729 or EventID==4733 or EventID==4747 or EventID==4752 or EventID==4756 or EventID==4762) and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Changed and Removed from Group(s)",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "accounts-changed-and-removed-from-groups-query ",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID==4740 and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Locked Out",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "accounts-locked-out-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID==4767 and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Unlocked",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "accounts-unlocked-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID==4725 and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Disabled",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "accounts-disabled-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID==4781 and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Renamed",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "accounts-renamed-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID==4723 and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Accounts Password Changed by user",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "accounts-password-changed-by-user-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where EventID==4724 and Account contains @\"{user_name_value}\"",
        "size": 0,
        "showAnalytics": true,
        "title": "Account Password Change by administrator",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "account-password-change-by-administrator-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_ppath_whitelist = process_create_whitelist | project process_parent_path;\r\nlet process_path_whitelist = process_create_whitelist | project process_path;\r\nlet command_line_whitelist = process_create_whitelist | project replace(\"'\", \"\", replace('\"', '', process_command_line));\r\nlet hash_whitelist = process_create_whitelist | project hash_sha256;\r\nSysmon\r\n| where RenderedDescription contains \"Process create\" and UserName == @\"{user_name_value}\"\r\n| where process_parent_path !in~ (process_ppath_whitelist) and process_path !in~ (process_path_whitelist) and replace('\"', '', tostring(process_command_line)) !in~ (command_line_whitelist) and hash_sha256 !in~ (hash_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, UserName, process_parent_path, process_path, file_name, process_parent_command_line, process_command_line, process_parent_guid, process_guid, hash_sha256, process_id, process_parent_id",
        "size": 0,
        "showAnalytics": true,
        "title": "Process Create",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "TimeGenerated",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "phase_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "UserName",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_parent_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "file_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_parent_command_line",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_command_line",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_parent_guid",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_guid",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "hash_sha256",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_parent_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "filter": true,
          "labelSettings": [
            {
              "columnId": "TimeGenerated",
              "label": "Time generated"
            },
            {
              "columnId": "technique_id",
              "label": "ID"
            },
            {
              "columnId": "technique_name",
              "label": "Technique"
            },
            {
              "columnId": "phase_name",
              "label": "Category"
            },
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "UserName",
              "label": "User"
            },
            {
              "columnId": "process_parent_path",
              "label": "Process parent path"
            },
            {
              "columnId": "process_path",
              "label": "Process path"
            },
            {
              "columnId": "file_name",
              "label": "File name"
            },
            {
              "columnId": "process_parent_command_line",
              "label": "Process parent command line"
            },
            {
              "columnId": "process_command_line",
              "label": "Process command line"
            },
            {
              "columnId": "process_parent_guid",
              "label": "Process parent GUID"
            },
            {
              "columnId": "process_guid",
              "label": "Process GUID"
            },
            {
              "columnId": "hash_sha256",
              "label": "Hash SHA256"
            },
            {
              "columnId": "process_id",
              "label": "Process ID"
            },
            {
              "columnId": "process_parent_id",
              "label": "Process parent ID"
            }
          ]
        }
      },
      "name": "process-create-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path_whitelist = process_access_whitelist | project process_path;\r\nlet target_process_path_whitelist = process_access_whitelist | project target_process_path;\r\nlet process_granted_access_whitelist = process_access_whitelist | project process_granted_access;\r\nSysmon\r\n| where RenderedDescription contains \"Process access\" and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (process_path_whitelist) and target_process_path !in~ (target_process_path_whitelist) and process_granted_access !in~ (process_granted_access_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, process_path, target_process_path, process_granted_access, target_process_guid, process_id, target_process_id",
        "size": 0,
        "showAnalytics": true,
        "title": "Process Access",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "TimeGenerated",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "phase_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "target_process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_granted_access",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "target_process_guid",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "target_process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "filter": true,
          "labelSettings": [
            {
              "columnId": "TimeGenerated",
              "label": "Time generated"
            },
            {
              "columnId": "technique_id",
              "label": "ID"
            },
            {
              "columnId": "technique_name",
              "label": "Technique"
            },
            {
              "columnId": "phase_name",
              "label": "Category"
            },
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "process_path",
              "label": "Process path"
            },
            {
              "columnId": "target_process_path",
              "label": "Target process path"
            },
            {
              "columnId": "process_granted_access",
              "label": "Process granted access"
            },
            {
              "columnId": "target_process_guid",
              "label": "Target pürocess GUID"
            },
            {
              "columnId": "process_id",
              "label": "Process ID"
            },
            {
              "columnId": "target_process_id",
              "label": "Target process ID"
            }
          ]
        }
      },
      "name": "process-access-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let file_name_whitelist = file_create_whitelist | project file_name;\r\nlet file_path_whitelist = file_create_whitelist | project file_path;\r\nlet proc_path_whitelist = file_create_whitelist | project process_path;\r\nSysmon\r\n| where RenderedDescription contains \"File create\" and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (proc_path_whitelist) and file_name !in~ (file_name_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, process_path, file_name, process_guid, process_id",
        "size": 0,
        "showAnalytics": true,
        "title": "File Created",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "TimeGenerated",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "phase_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "file_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_guid",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "filter": true,
          "labelSettings": [
            {
              "columnId": "TimeGenerated",
              "label": "Time generated"
            },
            {
              "columnId": "technique_id",
              "label": "ID"
            },
            {
              "columnId": "technique_name",
              "label": "Technique"
            },
            {
              "columnId": "phase_name",
              "label": "Category"
            },
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "process_path",
              "label": "Process path"
            },
            {
              "columnId": "file_name",
              "label": "File name"
            },
            {
              "columnId": "process_guid",
              "label": "Process GUID"
            },
            {
              "columnId": "process_id",
              "label": "Process ID"
            }
          ]
        }
      },
      "name": "file-created-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path__whitelist = image_load_whitelist | project process_path;\r\nlet driver_loaded_whitelist = image_load_whitelist | project driver_loaded;\r\nlet driver_signed_whitelist = image_load_whitelist | project driver_is_signed;\r\nlet drv_signature_whitelist = image_load_whitelist | project driver_signature;\r\nlet signat_status_whitelist = image_load_whitelist | project driver_signature_status;\r\nSysmon\r\n| where RenderedDescription contains \"Image loaded\" and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (process_path__whitelist) and module_loaded !in~ (driver_loaded_whitelist) and module_is_signed !in~ (driver_signed_whitelist) and module_signature !in~ (drv_signature_whitelist) and module_signature_status !in~ (signat_status_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, UserName, process_path, module_loaded, module_is_signed, module_signature, module_signature_status, process_id, process_guid",
        "size": 0,
        "showAnalytics": true,
        "title": "Image Loaded",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "TimeGenerated",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "phase_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "UserName",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "module_loaded",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "module_is_signed",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "module_signature",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "module_signature_status",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_guid",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "filter": true,
          "labelSettings": [
            {
              "columnId": "TimeGenerated",
              "label": "Time generated"
            },
            {
              "columnId": "technique_id",
              "label": "ID"
            },
            {
              "columnId": "technique_name",
              "label": "Technique"
            },
            {
              "columnId": "phase_name",
              "label": "Category"
            },
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "UserName",
              "label": "User"
            },
            {
              "columnId": "process_path",
              "label": "Process path"
            },
            {
              "columnId": "module_loaded",
              "label": "Module loaded"
            },
            {
              "columnId": "module_is_signed",
              "label": "Module is signed"
            },
            {
              "columnId": "module_signature",
              "label": "Module signature"
            },
            {
              "columnId": "module_signature_status",
              "label": "Module signature status"
            },
            {
              "columnId": "process_id",
              "label": "Process ID"
            },
            {
              "columnId": "process_guid",
              "label": "Process GUID"
            }
          ]
        }
      },
      "name": "image-loaded-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path_whitelist = network_whitelist | project process_path;\r\nlet src_ip_whitelist = network_whitelist | project src_ip;\r\nlet dst_ip_whitelist = network_whitelist | project dst_ip;\r\nlet dst_port_whitelist = network_whitelist | project dst_port;\r\nSysmon\r\n| where RenderedDescription contains \"Network connect\" and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (process_path_whitelist) and src_ip !in~ (src_ip_whitelist) and dst_ip !in~ (dst_ip_whitelist) and dst_port !in~ (dst_port_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, UserName, process_path, process_id, process_guid, src_ip, dst_ip, dst_port, src_host_name, dst_host_name",
        "size": 0,
        "showAnalytics": true,
        "title": "Network Connection",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "TimeGenerated",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "phase_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "UserName",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_guid",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "src_ip",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "dst_ip",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "dst_port",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "src_host_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "dst_host_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "TimeGenerated",
              "label": "Time generated"
            },
            {
              "columnId": "technique_id",
              "label": "ID"
            },
            {
              "columnId": "technique_name",
              "label": "Technique"
            },
            {
              "columnId": "phase_name",
              "label": "Category"
            },
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "UserName",
              "label": "User"
            },
            {
              "columnId": "process_path",
              "label": "Process path"
            },
            {
              "columnId": "process_id",
              "label": "Process ID"
            },
            {
              "columnId": "process_guid",
              "label": "Process GUID"
            },
            {
              "columnId": "src_ip",
              "label": "Source IP"
            },
            {
              "columnId": "dst_ip",
              "label": "Destination IP"
            },
            {
              "columnId": "dst_port",
              "label": "Destination port"
            },
            {
              "columnId": "src_host_name",
              "label": "Source hostname"
            },
            {
              "columnId": "dst_host_name",
              "label": "Destination hostname"
            }
          ]
        }
      },
      "name": "network-connection-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path_whitelist = remote_thread_whitelist | project process_path;\r\nlet target_process_path_whitelist = remote_thread_whitelist | project target_process_path;\r\nSysmon\r\n| where EventID == 8 and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (process_path_whitelist) and target_process_path !in~ (target_process_path_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, target_process_path, thread_new_id, process_guid, process_parent_guid",
        "size": 0,
        "showAnalytics": true,
        "title": "Create Remote Thread",
        "noDataMessage": "No create remote thread events for selected time generated",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "create-remote-thread-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let event_type_whitelist = registry_whitelist | project event_type;\r\nlet process_path_whitelist = registry_whitelist | project process_path;\r\nlet registry_key_path_whitelist = registry_whitelist | project registry_key_path;\r\nSysmon\r\n| where EventID == 12 and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (process_path_whitelist) and EventType !in~ (event_type_whitelist) and registry_key_path !in~ (registry_key_path_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, process_path, process_id, process_guid, registry_key_path",
        "size": 0,
        "showAnalytics": true,
        "title": "Registry Access",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "TimeGenerated",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "technique_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "phase_name",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_id",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "process_guid",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "registry_key_path",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "filter": true,
          "labelSettings": [
            {
              "columnId": "TimeGenerated",
              "label": "Time generated"
            },
            {
              "columnId": "technique_id",
              "label": "ID"
            },
            {
              "columnId": "technique_name",
              "label": "Technique"
            },
            {
              "columnId": "phase_name",
              "label": "Category"
            },
            {
              "columnId": "Computer",
              "label": "Host"
            },
            {
              "columnId": "process_path",
              "label": "Process path"
            },
            {
              "columnId": "process_id",
              "label": "Process ID"
            },
            {
              "columnId": "process_guid",
              "label": "Process GUID"
            },
            {
              "columnId": "registry_key_path",
              "label": "Registry key path"
            }
          ]
        }
      },
      "name": "registry-access-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let process_path_whitelist = pipe_whitelist | project process_path;\r\nlet pipe_name_whitelist = pipe_whitelist | project pipe_name;\r\nSysmon\r\n| where (EventID == 17 or EventID==18) and UserName == @\"{user_name_value}\"\r\n| where process_path !in~ (process_path_whitelist) and pipe_name !in~ (pipe_name_whitelist)\r\n| project TimeGenerated, technique_id, technique_name, phase_name, Computer, pipe_name, process_path, process_guid, process_id",
        "size": 0,
        "showAnalytics": true,
        "title": "Pipes",
        "noDataMessage": "No pipe create and connect events for selected time and user",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "time_span",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "pipes-query",
      "styleSettings": {
        "progressStyle": "loader"
      }
    },
    {
      "type": 1,
      "content": {
        "json": "---\r\nUser drilldown v.1.3.0, built by **Edoardo Gerosa**"
      },
      "name": "text - 26"
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}